Configuration/BusinessProcesses/ТестированиеКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<BusinessProcess>
		<Properties>
			<Name>ТестированиеКандидата</Name>
			<Task>Task.ЗадачаТестированиеКандидата</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПройденТестАдминистрирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПройденТестПрограммирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредложеннаяВакансия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Configuration/Enums/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Вакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оператор1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программист1С</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/BusinessProcesses/ТестированиеКандидата/Ext/ObjectModule.bsl
Процедура ПройденТестАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ПройденТестАдминистрирование;
	
КонецПроцедуры

Процедура ПройденТестПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ПройденТестПрограммирования;
	
КонецПроцедуры

Процедура ВакансияОператорПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакансии.Оператор1С;
	
КонецПроцедуры

Процедура ВакансияАдминистраторПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
     ПредложеннаяВакансия = Перечисления.Вакансии.Администратор1С;
	
КонецПроцедуры

Процедура ВакансияПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакансии.Программист1С;
	
КонецПроцедуры
